## Задание 1

In [245]:
import pandas as pd

In [246]:
authors = pd.DataFrame({'author_id': [1, 2, 3],
                      'author_name': ['Тургенев', 'Чехов', 'Островский']}
                      )

In [247]:
books = pd.DataFrame({'author_id' : [1, 1, 1, 2, 2, 3, 3],
                     'book_title' : ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                     'price' : [450, 300, 350, 500, 450, 370, 290]})

## Задание 2

In [248]:
authors_price = pd.merge(authors, books, on = 'author_id')

In [249]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

## Задание 3

In [250]:
top5 = authors_price.nlargest(5, 'price').sort_values(by='author_id').reset_index(drop=True)
# создаем фрейм, сортируем по автору и сбрасываем индексы

In [251]:
top5

   author_id author_name         book_title  price
0          1    Тургенев        Отцы и дети    450
1          1    Тургенев  Дворянское гнездо    350
2          2       Чехов   Толстый и тонкий    500
3          2       Чехов    Дама с собачкой    450
4          3  Островский              Гроза    370

## Задание 4

In [252]:
min_price = pd.DataFrame(authors_price.groupby('author_name')['price'].min())
min_price.rename(columns = {'price' : 'min_price'}, inplace=True)

In [253]:
max_price = pd.DataFrame(authors_price.groupby('author_name')['price'].max())
max_price.rename(columns = {'price' : 'max_price'}, inplace=True)

In [254]:
mean_price = pd.DataFrame(authors_price.groupby('author_name')['price'].mean().round(2))
mean_price.rename(columns = {'price' : 'mean_price'}, inplace=True)

In [255]:
# сливаем 2 фрейма, а потом получившийся сливаем с 3-им фреймом
authors_stat = pd.merge(pd.merge(min_price, max_price, on = 'author_name'), mean_price, on = 'author_name')

In [256]:
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370      330.00
Тургенев           300        450      366.67
Чехов              450        500      475.00

## Задание 5

In [257]:
authors_price.insert(4, 'cover', ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'])

In [258]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [259]:
book_info = authors_price.pivot_table('price', index = ['author_name'], columns = ['cover'], aggfunc = 'sum', fill_value=0)

In [260]:
book_info

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [261]:
book_info.to_pickle('book_info.pkl')

In [262]:
book_info_new = pd.read_pickle('book_info.pkl')

In [263]:
book_info_new

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950